In [2]:
import numpy as np
import pandas as pd

In [3]:
index = ['bob','lisa','jen','lihua']
columns = ['python','java','ruby','UI']
data = np.random.randint(60,100,size=(4,4))
df = pd.DataFrame(
    data=data,
    index=index,
    columns=columns
)
df

       python  java  ruby  UI
bob        78    90    83  85
lisa       87    86    98  73
jen        91    75    77  81
lihua      60    69    83  88

## 一,describe（）

In [5]:
df1 = df.copy()
df1

       python  java  ruby  UI
bob        78    90    83  85
lisa       87    86    98  73
jen        91    75    77  81
lihua      60    69    83  88

In [12]:
df1.describe()
#count:出现的次数
#std:标准差

          python      java       ruby     UI
count   4.000000   4.00000   4.000000   4.00
mean   79.000000  80.00000  85.250000  81.75
std    13.784049   9.69536   8.958236   6.50
min    60.000000  69.00000  77.000000  73.00
25%    73.500000  73.50000  81.500000  79.00
50%    82.500000  80.50000  83.000000  83.00
75%    88.000000  87.00000  86.750000  85.75
max    91.000000  90.00000  98.000000  88.00

In [13]:
#可自己对定义要查询的百分位数
df1.describe([0.4])#查询40%位数

          python      java       ruby     UI
count   4.000000   4.00000   4.000000   4.00
mean   79.000000  80.00000  85.250000  81.75
std    13.784049   9.69536   8.958236   6.50
min    60.000000  69.00000  77.000000  73.00
40%    79.800000  77.20000  83.000000  81.80
50%    82.500000  80.50000  83.000000  83.00
max    91.000000  90.00000  98.000000  88.00

In [14]:
#用.T把行与列转置
df1.describe([0.12,0.4,0.3]).T

        count   mean        std   min    12%   30%   40%   50%   max
python    4.0  79.00  13.784049  60.0  66.48  76.2  79.8  82.5  91.0
java      4.0  80.00   9.695360  69.0  71.16  74.4  77.2  80.5  90.0
ruby      4.0  85.25   8.958236  77.0  79.16  82.4  83.0  83.0  98.0
UI        4.0  81.75   6.500000  73.0  75.88  80.2  81.8  83.0  88.0

## 二,std()

In [17]:
#std:标准差
df1.std()

python    13.784049
java       9.695360
ruby       8.958236
UI         6.500000
dtype: float64

## 三,drop()

In [18]:
#删除特定的索引
df3 = df.copy()
df3

       python  java  ruby  UI
bob        78    90    83  85
lisa       87    86    98  73
jen        91    75    77  81
lihua      60    69    83  88

In [21]:
#默认行索引
df3.drop('bob')
#axis=为列索引

#或用index=与columns=参数
df3.drop(columns='UI')

       python  java  ruby
bob        78    90    83
lisa       87    86    98
jen        91    75    77
lihua      60    69    83

In [22]:
#删除多列（行）用[]
df3.drop(index=['bob','jen'])

       python  java  ruby  UI
lisa       87    86    98  73
lihua      60    69    83  88

## 四,unique()

In [25]:
df4 = df.copy()
df4[0,0]=60
df4

       python  java  ruby  UI  (0, 0)
bob        78    90    83  85      60
lisa       87    86    98  73      60
jen        91    75    77  81      60
lihua      60    69    83  88      60

In [26]:
#datafrane不能用仅series可
df4.iloc[:,4].unique()

array([60])

## 五,query()

In [27]:
df5 = df.copy()
df5

       python  java  ruby  UI
bob        78    90    83  85
lisa       87    86    98  73
jen        91    75    77  81
lihua      60    69    83  88

In [30]:
df5.query('python==78')#找到python为9的所有行

     python  java  ruby  UI
bob      78    90    83  85

In [36]:
#逻辑运算
#and:&
#or:|
#in成员运算符

df5.query('python>60 and java<80')
df5.query('python>60 & java<80')

df5.query('python>80 or java<70')
df5.query('python>80 | java<70')

df5.query('python in [78,79,80]')

     python  java  ruby  UI
bob      78    90    83  85

In [39]:
#使用变量
n=80
#@ + 变量名 表示使用变量
df5.query('python>@n')

      python  java  ruby  UI
lisa      87    86    98  73
jen       91    75    77  81

## 六, sort_values()与sort_index()

In [40]:
df6 = df.copy()
df6

       python  java  ruby  UI
bob        78    90    83  85
lisa       87    86    98  73
jen        91    75    77  81
lihua      60    69    83  88

In [45]:
#按python的值排序
#默认列
df6.sort_values('python')

#ascending默认升序值为True
df6.sort_values('python',ascending=False)

       python  java  ruby  UI
jen        91    75    77  81
lisa       87    86    98  73
bob        78    90    83  85
lihua      60    69    83  88

In [48]:
#默认行
df6.sort_index()

#ascending默认升序值为True
df6.sort_index(ascending=False)

       python  java  ruby  UI
lisa       87    86    98  73
lihua      60    69    83  88
jen        91    75    77  81
bob        78    90    83  85

## 七,info()

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, bob to lihua
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   python  4 non-null      int32
 1   java    4 non-null      int32
 2   ruby    4 non-null      int32
 3   UI      4 non-null      int32
dtypes: int32(4)
memory usage: 268.0+ bytes